# specify directory to install
cask_args appdir: "/Applications"

# install packages + some apps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "ansible"
brew "docutils"
brew "awscli"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "go"
brew "helm"
brew "hub"
brew "jq"
brew "k6"
brew "make"
brew "neovim"
brew "openssl@1.1"
brew "rust"
brew "terraform"
brew "terraform-ls"
brew "wget"
brew "python"
brew "node"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew 'bash-completion'
brew 'neovim'

# casks
cask "docker"
cask "emacs"
cask "visual-studio-code"
cask "google-chrome"
cask "zoom"
cask "slack"
cask "iterm2"
cask "fork"
cask "bitwarden"
cask "postman"

# # install vscode extensions
# function vscode() {
#   code --install-extension $1
# }

vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
